Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: །རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་བ་དམ་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་ངས་མངོན་པར་ཤེས་ཏེ། གང་དག་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ནི་འགོག་པ་ལ་མཉམ་པར་བཞག་པའི་སེམས་ཀྱིས་བར་གྱི་བསྐལ་པ་བཅུ་པོ་འདི་དག་འདའ་བར་བྱེད་དོ།
en: Noble sons, the tathāgata arhat samyaksam­buddha Candrottama addressed the bodhisattvas, saying, ‘Noble sons, I perceive that the bodhisattvas who have one lifetime remaining will spend these ten intermediate eons with their minds at rest in cessation.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷག་མ་རྣམས་ཀྱིས་ནི་བར་གྱི་བསྐལ་པ་བཅུ་པོ་འདི་དག་ལ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་ཕྱག་རྒྱ་འདི་ལས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་འདི་ཉིད་ཐོས་པར་གྱུར་ཅིང་བར་གྱི་བསྐལ་པ་བཅུ་པོ་འདི་དག་ལ་ཆོས་རྣམས་ཐོས་ནས་ཀྱང་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དེ་དག་ན།
en: During these ten intermediate eons, the other bodhisattva mahāsattvas will listen to this bodhisattva piṭaka, the dhāraṇī entranceway that is the form of omniscience, from the bodhisattva mahāsattva Gaganamudra.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ།
en: They will listen to the Dharma for ten intermediate eons, trusting the countless bhagavat buddhas who reside, live, and remain in countless buddha realms in the ten directions.

source: དེ་དག་ལ་སེམས་མངོན་པར་རབ་ཏུ་དང་བར་བྱས་ཏེ་སེམས་རབ་ཏུ་དང་བའི་རྒྱུ་དེས་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་གྱུར་ནས། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་རྣམ་པ་སྣ་ཚོགས་དག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་བ་དམ་པ་ལ་མཆོད་པ་བྱས་ནས།
en: That complete trust will generate good roots, and they will make offerings to the tathāgata arhat samyaksam­buddha Candrottama through various kinds of bodhisattva miracles.’ “

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་དུ་བཙུན་པ་བཅོམ་ལྡན་འདས་བར་གྱི་བསྐལ་པ་བཅུ་པོ་འདི་དག་འདས་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་ཕྱག་རྒྱ་འདི་ཆོས་དང་ལྡན་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བླ་ན་མེད་པ་སྐོར་བར་འགྱུར་ལགས་སམ་ཞེས་གསོལ་པ་དང་།
en: The bodhisattvas asked the Bhagavat, ‘Bhadanta Bhagavat, after these ten intermediate eons have passed, will the bodhisattva mahāsattva Gaganamudra turn the unsurpassable Dharma wheel that possesses the Dharma?’ “

source: བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ།
en: Candrottama said to them, ‘Noble sons, it will be so, it will be so.

source: བར་གྱི་བསྐལ་པ་བཅུ་པོ་འདི་དག་འདས་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་ཕྱག་རྒྱ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: When these ten intermediate eons have passed, the bodhisattva mahāsattva Gaganamudra will attain the complete enlightenment of perfect buddhahood.

source: དེ་གང་གི་ནུབ་མོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེ་ཉིད་ཀྱི་ནུབ་མོ་འདས་ནས་ཆོས་དང་ལྡན་པའི་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བར་འགྱུར་ཞིང་།
en: Following the night that he attains the complete enlightenment of perfect buddhahood, he will turn the unsurpassable Dharma wheel that possesses the Dharma.

source: དེར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་བར་གྱི་བསྐལ་པ་བཅུར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་འདི་ཉིད་སྟོན་པར་འགྱུར་རོ།
en: For ten intermediate eons he will teach the bodhisattvas the dhāraṇī entranceway that is the form of omniscience.

source: །དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་དེ་ལ་ཆོས་ཉན་པར་འགྱུར་བ་དེ་དག་ནི་ཆོས་དེ་ཐོས་པས་དགེ་བའི་རྩ་བ་དག་བསྐྱེད་ནས། གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་ཕྱག་རྒྱ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞིང་།
en: The bodhisattva mahāsattvas will listen to that Dharma and will generate good roots through hearing it.

source: དེས་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཆོས་དང་ལྡན་པའི་ཆོས་ཀྱི་འཁོར་ལོ། རབ་མཆོག་གི་འཁོར་ལོ་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་བསྐོར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་རྣམས་ཕྱིར་མི་ལྡོག་པ་ལ་བཀོད་ཅིང་།
en: After the bodhisattva Gaganamudra has attained the complete enlightenment of perfect buddhahood, he will turn the irreversible supreme wheel, the Dharma wheel that possesses the Dharma, and he will establish many hundreds of millions of trillions of bodhisattvas in irreversibility.

source: དེར་བར་གྱི་བསྐལ་པ་བཅུར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པའི་ཆོས་འདི་སྟོན་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དེ་ལས་ཉན་པར་འགྱུར་ཏེ།
en: For ten intermediate eons those bodhisattvas will listen to him teaching this dhāraṇī entranceway that is the form of omniscience.

source: དེའི་ཚེ་དེ་དག་གིས་ཆོས་ཐོས་ནས་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པར་འགྱུར་རོ།
en: When they have heard that Dharma, they will have only one remaining lifetime.

source: །གང་དག་བསྐལ་པར་ཉན་པར་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནི་དེའི་ཚེ་ན་ས་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཏེ་དེ་ཉིད་ཀྱི་ཚེ་ན་གཟུངས་འདི་ཡང་མཐར་ཐུག་པ་ཐོབ་པར་འགྱུར་རོ།
en: The bodhisattvas who have listened for an eon will at that time enter the tenth bhūmi and have irreversible progress toward the highest, most complete enlightenment. At that time, they will have the ultimate attainment of this dhāraṇī.’ “

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་བ་དམ་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་དེ་སྐད་ཅེས་བཀའ་སྩལ་ཏེ། སངས་རྒྱས་ཀྱི་ཡུལ་གྱི་ཆོ་འཕྲུལ་སྣ་ཚོགས་དག་ཡང་དག་པར་བསྟན་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་ཕྱག་རྒྱ་ལ་ཏིང་ངེ་འཛིན་སྲེད་མེད་ཀྱི་བུ་ཞེས་བྱ་བ་བསྟན་ཏེ།
en: After the tathāgata arhat samyaksam­buddha Candrottama had spoken those words to the bodhisattva mahāsattvas, he manifested the various miracles that are the domain of the buddhas.

source: ལུས་རྡོ་རྗེ་ལྟ་བུར་བྱིན་གྱིས་རློབ་པར་མཛད་པ་དང་། ཏིང་ངེ་འཛིན་འོད་བཀོད་པ་ཞེས་བྱ་བ་ངེས་པར་སྟོན་ཅིང་།
en: He showed the nārāyaṇa samādhi to the bodhisattva mahāsattva Gaganamudra and then transformed his body into diamond and showed him the array of light samādhi. “

source: དེར་བར་གྱི་བསྐལ་པ་བཅུར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པའི་ཆོས་བསྟན་པ་འདིས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཏེ།
en: Then for ten intermediate eons, he turned the wheel of the Dharma for the bodhisattvas, teaching them the Dharma of this dhāraṇī entranceway that is the form of omniscience.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་སངས་རྒྱས་ཀྱི་སྐུ་མཚན་དང་དཔེ་བྱད་བཟང་པོས་བརྒྱན་པ་དག་གསལ་ཞིང་སྣང་བར་བྱེད་པ་དང་།
en: He revealed and made clear the adorning signs and indications of the buddhas in all the buddha realms.

source: ཏིང་ངེ་འཛིན་རྡོ་རྗེ་དཀྱིལ་འཁོར་ཞེས་བྱ་བ་ངེས་པར་སྟོན་ཅིང་།
en: He taught the samādhi called circle of vajras.

source: དེས་བྱང་ཆུབ་ཀྱི་གདན་ལ་ཆོས་ཀྱི་འཁོར་ལོ་ཤིན་ཏུ་བསྐོར་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཆོས་སྟོན་པར་བྱེད་པ་དང་།
en: He taught the Dharma to the bodhisattvas by perfectly turning the wheel of the Dharma on the seat of enlightenment.

source: ཏིང་ངེ་འཛིན་འཁོར་ལོའི་ཕྲེང་བ་ཞེས་བྱ་བ་ངེས་པར་སྟོན་ཅིང་།
en: He taught them the garland of wheels samādhi.

source: དེ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ན་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་རྣམས་ཀྱང་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་འགྱུར་བའི་ཕྱིར་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་འགོད་པར་རིག་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་ཕྱག་རྒྱ་དང་། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དཔག་ཏུ་མེད་པ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས།
en: He turned the wheel of the Dharma for many hundreds of thousands of tens of millions of thousands of millions of beings and through the wheel of the Dharma established them in irreversibility. “Knowing this, the bodhisattva mahāsattva Gaganamudra and an innumerable saṅgha of bodhisattvas made offerings to the Bhagavat.

source: རང་རང་གི་ཁང་པ་བརྩེགས་པ་དག་ཏུ་ཞུགས་ཏེ་འདུག་གོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་བ་དམ་པ་ཡང་དེ་ཉིད་ཀྱི་ནུབ་མོ་ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ།
en: Then they each entered their own kūṭāgāra and remained there through the night when the tathāgata arhat samyaksam­buddha Candrottama passed into parinirvāṇa, into the state of nirvāṇa without any remaining aggregates.

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་དེ་ཉིད་ཀྱི་མཚན་མོ་འདས་ནས། བཅོམ་ལྡན་འདས་དེའི་སྐུ་གདུང་ལ་མཆོད་པ་བྱས་ཏེ་རང་རང་གི་ཁང་པ་བརྩེགས་པ་དག་ཏུ་ཞུགས་པར་གྱུར་ཏོ།
en: When that night was over, the bodhisattvas made offerings to the Bhagavat’s body, and then each entered their own kūṭāgāra.

source: །བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་ནི་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་དོང་ངོ་།
en: The other bodhisattvas all returned to their own buddha realms.

source: །དེ་ན་གང་དག་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནི་འགོག་པ་ལ་སྙོམས་པར་ཞུགས་པ་ཉིད་ཀྱིས་བར་གྱི་བསྐལ་པ་བཅུ་པོ་དེ་དག་འདའ་བར་བྱེད་དོ།
en: The bodhisattvas who had but one life remaining stayed in the samādhi of cessation for ten intermediate eons. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་ཕྱག་རྒྱ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལས་བརྩམས་ཏེ་ཆོས་སྟོན་པར་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་ཀྱང་བར་གྱི་བསྐལ་པ་བཅུར་དགེ་བའི་རྩ་བ་དག་བསྐྱེད་པར་འགྱུར་ཏེ། མདང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས།
en: The bodhisattva mahāsattva Gaganamudra taught the Dharma for the bodhisattva mahāsattvas, and those bodhisattva mahāsattvas generated good roots during those ten intermediate eons.

source: དེས་ད་ནང་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཏེ་ཆོ་འཕྲུལ་ཆེན་པོ་བསྟན་ནས།
en: In the night, he attained the highest, most complete enlightenment of perfect buddhahood and the next day he turned the wheel of the Dharma and manifested great miracles.

source: སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་དོ།
en: He established many hundreds of thousands of millions of trillions of beings in the highest, most complete enlightenment.

source: །ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་འདི་བཤད་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཁྲག་ཁྲིག་ས་ཡ་ཕྲག་བརྒྱད་ཀྱིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །སྲོག་ཆགས་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་གཉིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ལ་བཀོད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་ཁྲག་ཁྲིག་ཕྲག་བདུན་ཅུ་རྩ་གཉིས་ཀྱིས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པའི་གཟུངས་འདི་ཐོབ་བོ། །ལྷ་དང་མི་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་རྣམས་ཀྱིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: Also when he taught the dhāraṇī entranceway that is the form of omniscience, eight hundred thousand trillion bodhisattvas attained the forbearance that comes from realizing the birthlessness of phenomena; 920,000,000 beings were established in irreversible progress toward the highest, most complete enlightenment; 72,000,000,000 bodhisattvas obtained this dhāraṇī entranceway that is the form of omniscience; and countless devas and humans developed the motivation to attain complete enlightenment.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བྱེད་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་དུ་དང་ལྡན་ན་གཟུངས་འདི་འཐོབ་ལགས།
en: Then the bodhisattva mahāsattva Ratnavairocana asked the Bhagavat, “Bhadanta Bhagavat, which qualities must bodhisattva mahāsattvas possess in order to obtain this dhāraṇī?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་དང་ལྡན་ན་གཟུངས་འདི་འཐོབ་སྟེ།
en: Noble son,” replied the Bhagavat, “bodhisattva mahāsattvas will obtain this dhāraṇī if they possess four qualities.

source: བཞི་གང་ཞེ་ན།
en: What are these four?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པའི་རིགས་བཞི་ལ་ལེགས་པར་གནས་པ་ཡིན་ཏེ།
en: The bodhisattva mahāsattvas remain within four noble traditions.

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོས་ངན་ངོན་ཙམ་གྱིས་དགའ་ཞིང་ཆོག་ཤེས་ལ། གོས་ངན་ངོན་ཙམ་གྱིས་ཆོག་ཤེས་པའི་བསྔགས་པ་ཡང་རྗོད་པར་བྱེད་ཅིང་། དེ་གོས་ཀྱི་ཕྱིར་ཚུལ་དང་མི་འཐུན་པར་མི་བྱེད་ལ། གོས་མ་རྙེད་ན་ཡང་ཡོངས་སུ་གདུང་བ་མེད་ཅིང་།
en: The bodhisattva mahāsattvas remain in this first noble tradition: the bodhisattva mahāsattvas should be pleased and satisfied with any kind of robes.

source: གོས་རྙེད་ན་ཡང་ཆགས་པ་མེད་པ་དང་། ཞེན་པ་མེད་པ་དང་། འཁྲེན་པ་མེད་པ་དང་། མདུད་པ་བོར་བ་མེད་པ་དང་། བརྒྱལ་བ་མེད་པ་དང་།
en: They praise being content with any kind of robes; they do not act inappropriately for the sake of robes; they are not saddened if they have not acquired clothing; and if they obtain clothing, they wear it without desire, without clinging, without longing, without becoming fettered, without becoming infatuated, and without covetousness.

source: ལྷག་པར་ཆགས་པ་མེད་པ་དང་། ལྷག་པར་ཆགས་པར་གྱུར་པ་མེད་པར་ཡོངས་སུ་སྤྱོད་པར་བྱེད་ཅིང་།
en: They acquire it without covetousness.

source: ཉེས་དམིགས་སུ་ལྟ་ལ་ངེས་པར་འབྱུང་བར་རབ་ཏུ་ཤེས་ཤིང་ཡོངས་སུ་སྤྱོད་པར་བྱེད་པ་སྟེ།
en: They wear it while seeing the defects of saṃsāra and with the knowledge of going forth into homelessness. “

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པའི་རིགས་ལ་ལེགས་པར་གནས་པ་དང་པོ་ཡིན་ནོ། །གོས་ལ་ཇི་ལྟ་བ་བཞིན་དུ་བསོད་སྙོམས་དང་། མལ་ཆ་དང་སྟན་ལ་ཡང་དེ་བཞིན་ནོ།
en: As it is in the noble tradition for robes, so it is for alms, and it is the same noble tradition for beds and seats.

source: །གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ན་བའི་གསོས་སྨན་དང་ཡོ་བྱད་ངན་ངོན་ཙམ་གྱིས་དགའ་ཞིང་ཆོག་ཤེས་ལ། ན་བའི་གསོས་སྨན་དང་ཡོ་བྱད་ངན་ངོན་ཙམ་གྱིས་ཆོག་ཤེས་པའི་བསྔགས་པ་ཡང་རྗོད་པར་བྱེད་ཅིང་དེ་ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་ཀྱི་ཕྱིར་ཚུལ་དང་མི་འཐུན་པ་ཚོལ་བར་མི་བྱེད་ལ། དེ་ན་བའི་གསོས་སྨན་དང་ཡོ་བྱད་མ་རྙེད་ན་ཡང་ཡོངས་སུ་གདུང་བ་མེད་ཅིང་རྙེད་ན་ཡང་ཆགས་པ་མེད་པ་དང་། ཞེན་པ་མེད་པ་དང་། འཁྲེན་པ་མེད་པ་དང་། མདུད་པ་བོར་བ་མེད་པ་དང་།
en: The fourth noble tradition is that the bodhisattva mahāsattvas are pleased and satisfied with any kind of necessities and any medicine; they praise being satisfied with any kind of necessities and any medicine; they do not act inappropriately for the sake of necessities or for the sake of medicines; they are not saddened if they have not acquired necessities and have not acquired medicines; and if they obtain necessities and obtain medicines they utilize them without desire, without clinging, without longing, without becoming fettered, without becoming infatuated, and without covetousness.

source: བརྒྱལ་བ་མེད་པ་དང་། ལྷག་པར་ཆགས་པ་མེད་པ་དང་། ལྷག་པར་ཆགས་པར་གྱུར་པ་མེད་པར་ཡོངས་སུ་སྤྱོད་པར་བྱེད་ཅིང་།
en: They acquire them without covetousness.

source: ཉེས་དམིགས་སུ་ལྟ་བ་ལ་ངེས་པར་འབྱུང་བ་རབ་ཏུ་ཤེས་ཤིང་ཡོངས་སུ་སྤྱོད་པར་བྱེད་པ་སྟེ།
en: They utilize them while seeing the defects of saṃsāra and with the knowledge of going forth into homelessness.

source: འཕགས་པའི་རིགས་བཞི་པོ་དེ་དག་ལ་ལེགས་པར་གནས་ཤིང་།
en: The bodhisattva mahāsattvas remain in these four noble traditions.

source: ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་གཟུངས་འདི་ཐོབ་ཅིང་སྒོམ་པར་བྱེད་པ་ཡིན་ནོ།
en: The bodhisattva mahāsattvas who possess those four qualities will obtain this dhāraṇī and meditate on it. “

source: །གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ལྔ་དང་ལྡན་ན་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པའི་གཟུངས་འདི་འཐོབ་སྟེ།
en: The bodhisattva mahāsattvas will also obtain this dhāraṇī entranceway that is the form of omniscience if they possess five other qualities.

source: ལྔ་གང་ཞེ་ན།
en: What are these five?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་ཀྱང་ཚུལ་ཁྲིམས་དང་ལྡན་པར་གནས་པ་དང་། སོ་སོར་ཐར་པའི་སྡོམ་པས་བསྡམས་པ་དང་། ཆོ་ག་དང་སྤྱོད་ཡུལ་ཕུན་སུམ་ཚོགས་པ་དང་། ཁ་ན་མ་ཐོ་བ་ཕྲ་རབ་ཙམ་དག་ལ་ཡང་འཇིགས་པར་ལྟ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་ཡང་དག་པར་བླངས་ཤིང་སློབ་པར་བྱེད་ལ།
en: The bodhisattva mahāsattvas remain in possession of correct conduct; they are restrained by the prātimokṣa vows; they have perfect rules of conduct and range of conduct; they see the danger in the tiniest particle of blameworthy actions; they adopt and train in the precepts; and when they see others who are devoid of correct conduct, they cause them to possess a perfectly correct conduct, training them, guiding them, and establishing them in that.

source: །གཞན་ཚུལ་ཁྲིམས་དང་བྲལ་བ་དག་མཐོང་ན་ཡང་ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ལ།
en: The bodhisattva mahāsattvas are endowed with that first quality. “

source: འདུལ་ཞིང་འཛུད་ལ་རབ་ཏུ་འགོད་པ་བྱེད་པ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་དང་པོ་དེ་དང་ལྡན་པ་དང་། གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་ལྟ་བ་ལ་ཞེན་པར་གྱུར་པ་རྣམས་ལོག་པར་ལྟ་བ་ལས་རྣམ་པར་བསླང་ཞིང་། ཡང་དག་པའི་ལྟ་བ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ལ་འདུལ་ཞིང་འཛུད་ལ་རབ་ཏུ་འགོད་པར་བྱེད་པ་སྟེ།
en: Also, when the bodhisattva mahāsattvas make beings who are attached to a wrong view abandon that wrong view, they cause them to possess a correct view, training them, guiding them, and establishing them in that.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་གཉིས་པ་དེ་དང་ལྡན་པ་དང་།
en: The bodhisattva mahāsattvas are endowed with that second quality. “

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་ཆོ་ག་མ་ཡིན་པ་ལ་ཞེན་པར་གྱུར་པ་རྣམས་ཡང་དག་པའི་ཆོ་ག་ཡང་དག་པར་འཛིན་དུ་འཇུག་ལ།
en: Also, when the bodhisattva mahāsattvas make beings who are attached to wrong conduct abandon their wrong conduct, they cause them to possess perfect conduct, training them, guiding them, and establishing them in that.

source: འདུལ་ཞིང་འཛུད་ལ་རབ་ཏུ་འགོད་པར་བྱེད་པ་སྟེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་གསུམ་པ་དེ་དང་ལྡན་པ་དང་།
en: The bodhisattva mahāsattvas are endowed with that third quality. “

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་བསམ་པ་ཉམས་པར་གྱུར་པ་རྣམས་བསམ་པ་ཕུན་སུམ་ཚོགས་པ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ལ། འདུལ་ཞིང་འཛུད་ལ་རབ་ཏུ་འགོད་པར་བྱེད་པ་སྟེ།
en: Also, the bodhisattva mahāsattvas cause beings who have a defective aspiration to possess a perfect aspiration, training them, guiding them, and establishing them in that.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་པོ་དེ་དང་ལྡན་པ་དང་།
en: The bodhisattva mahāsattvas are endowed with that fourth quality. “

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ལ་འདུལ་ཞིང་འཛུད་ལ་རབ་ཏུ་འགོད་པར་བྱེད་པ་སྟེ།
en: Also, the bodhisattva mahāsattvas make those who are following the Śrāvakayāna and the Pratyekabuddhayāna realize the highest, most complete enlightenment, training them, guiding them, and establishing them in that.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ལྔ་པོ་དེ་དག་དང་ལྡན་པ་སྟེ།
en: The bodhisattva mahāsattvas are endowed with that fifth quality. “

source: ཆོས་ལྔ་པོ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི་གཟུངས་འདི་འཐོབ་བོ།
en: The bodhisattva mahāsattvas who possess those five qualities will obtain this dhāraṇī. “

source: །གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་དྲུག་དང་ལྡན་ན་གཟུངས་འདི་འཐོབ་སྟེ།
en: The bodhisattva mahāsattvas will also obtain this dhāraṇī entranceway that is the form of omniscience if they possess six other qualities.

source: དྲུག་གང་ཞེ་ན། འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདག་ཉིད་ཀྱང་ཐོས་པ་མང་བ་དང་། ཐོས་པ་འཛིན་པ་དང་།
en: What are these six? (

source: ཐོས་པ་བསགས་པ་ཡིན་པས་དེས་ཆོས་ཚངས་པར་སྤྱོད་པ་ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བ། དོན་བཟང་པོ། ཚིག་འབྲུ་བཟང་པོ། མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ།
en: 1) “The bodhisattva mahāsattvas themselves are learned, possess learning, and accumulate learning, and thereby their articulate teaching of the Dharma, of celibacy, is virtuous in the beginning, virtuous in the middle, and virtuous in the end; it has good meaning, has good words, is unalloyed, is complete, is pure, and is immaculate.

source: ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ་གང་ཡིན་པ་དེ་མངོན་པར་བརྗོད་པས་མངོན་པར་རྗོད་ཅིང་། དེ་དེ་ལྟ་བུའི་ཆོས་མང་པོ་དག་ཐོས་ནས་བཟུང་སྟེ། ཁ་ཏོན་ཡོངས་སུ་བྱང་བ་དང་། ཡིད་ཀྱིས་བརྟགས་པ་དང་།
en: They learn and possess many such Dharma teachings, recite them, mentally examine them, and understand them through contemplating them.

source: མཐོང་བས་ཤིན་ཏུ་རྟོགས་པར་བྱས་ཤིང་། དེ་དེ་ལྟར་མང་དུ་ཐོས་པར་གྱུར་པ་ན་ཐོས་པ་ཉུང་བའི་སེམས་ཅན་གཞན་དག་མང་དུ་ཐོས་པ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ལ་འདུལ་ཞིང་འཛུད་ལ་རབ་ཏུ་འགོད་པར་བྱེད་པ་སྟེ།
en: They, who are thus very learned, make others with little learning very learned, training them, guiding them, and establishing them in that.

source: ཆོས་དང་པོ་དེ་དང་ལྡན་པ་དང་།
en: They are endowed with that first quality. (

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཕྲག་དོག་དང་། སེར་སྣ་མེད་ཅིང་ཕྲག་དོག་དང་། སེར་སྣས་ཟིལ་གྱིས་ནོན་པའི་སེམས་ཅན་གཞན་དག་ཀྱང་ཕྲག་དོག་མེད་པ་དང་། གཏོང་བ་ཕུན་སུམ་ཚོགས་པ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ལ། རབ་ཏུ་འགོད་པར་བྱེད་པའི་བར་དུ་སྟེ།
en: 2) “Also, the bodhisattva mahāsattvas are without envy and miserliness, and they make those beings overpowered by envy and miserliness become free of envy and have perfect generosity, and they train them, guide them, and establish them in that.

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་རྣམས་ལ་འཚེ་བར་མི་བྱེད་ཅིང་མི་འཇིགས་པ་རབ་ཏུ་སྦྱིན་པར་བྱེད་ལ་གནོད་པ་སྣ་ཚོགས་གནོད་པར་གྱུར་པའི་སེམས་ཅན་རྣམས་གནོད་པ་དག་ལས་ཡོངས་སུ་ཐར་བར་བྱེད་པའི་རང་བཞིན་ཅན་ཡིན་པ་དང་། ཚུལ་འཆོས་པ་མེད་ཅིང་ཁ་གསག་མེད་པ་དང་། སྒྱུ་མེད་ཅིང་གཡོ་མེད་པ་དང་། སྟོང་པ་ཉིད་ཀྱིས་ལན་མང་དུ་གནས་པར་བྱེད་པ་སྟེ།
en: 3) “Also, the bodhisattva mahāsattvas do not harm beings; (4) they free beings from fear, freeing from calamities those beings afflicted by various calamities; (5) they are not fakes, not just talk, not frauds, and not deceivers; and (6) they frequently dwell in emptiness.

source: ཆོས་དྲུག་པོ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པའི་གཟུངས་འདི་འཐོབ་བོ།
en: The bodhisattva mahāsattvas who possess those six qualities will obtain this dhāraṇī entranceway that is the form of omniscience. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་དེ་ལྟ་བུ་དག་དང་ལྡན་པས་ལོ་བདུན་དུ་འགྲོ་ལྡིང་བའི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ཐམས་ཅད་ལ་ཉིན་གཅིག་ཅིང་ལན་གསུམ་གསུམ་ཡན་ལག་ལྔས་མདོ་དང་རྒྱས་པར་ཕྱག་བྱས་ཤིང་ལུས་སུ་གཏོགས་པའི་དྲན་པ་ཉེ་བར་བཞག་སྟེ།
en: The bodhisattva mahāsattvas who have those qualities should perform this Dravidian mantra, either in brief or in full, three times each day for seven years.

source: སྟོང་པ་ཉིད་ལས་གནས་པས་འགྲོ་ལྡིང་བའི་གསང་སྔགས་ཀྱི་གཞི་འདི་བརྗོད་པར་བགྱིའོ།
en: They should bow down the five points of their body to the ground, maintain mindfulness of the body, and while dwelling in emptiness recite the Dravidian mantra.

source: །ལངས་ནས་ཀྱང་ཕྱོགས་བཅུ་ཀུན་ནས་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དྲན་པར་བྱེད་པ་དང་།
en: Then, when they stand up, they should be mindful of the bhagavat buddhas who reside, live, and remain in the surrounding worlds in the ten directions.

source: རྟག་ཏུ་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་བསྒོམ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ལོ་བདུན་འདས་ནས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པའི་གཟུངས་འདི་འཐོབ་བོ།
en: After seven years of continuous mindfulness of the buddhas, the bodhisattva mahāsattvas will attain this dhāraṇī entranceway that is the form of omniscience.

source: །གཟུངས་འདི་འཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཤེས་རབ་ཀྱི་མིག་གང་གིས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོ་འཕྲུལ་ཆེན་པོ་རྣམ་པར་སྟོན་པར་མཛད་པ་ཐམས་ཅད་ཀྱང་མཐོང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་འཕགས་པའི་ཤེས་རབ་ཀྱི་མིག་ཀྱང་འཐོབ་ཅིང་།
en: The bodhisattva mahāsattvas who have attained this dhāraṇī will see, with the eye of wisdom, all the bhagavat buddhas who reside, live, remain, and also manifest miracles within buddha realms as numerous as the grains of sand in the Ganges River in the ten directions, in that way attaining the noble eye of wisdom.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་འཛུམ་པ་རྣམ་པར་བསྟན་པ་དག་ཀྱང་མཐོང་ནས།
en: They will also see the bhagavat buddhas smiling.

source: གཟུངས་ཀྱི་སྒོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡང་འཐོབ་བོ།
en: They will attain 84,000 dhāraṇī entranceways.

source: །ཏིང་ངེ་འཛིན་གྱི་སྒོ་བདུན་ཁྲི་ཉིས་སྟོང་ཡང་འཐོབ་བོ།
en: They will also attain 72,000 samādhi entranceways.

source: །ཆོས་ཀྱི་སྒོ་དྲུག་ཁྲི་ཡང་འཐོབ་སྟེ།
en: They will also attain 60,000 Dharma entranceways. “
